#include <stdio.h>

//操作符
//算数操作符 + - * / %
//移位操作符 >>  <<


int main1() {

    int a = 16;
    int b = a >> 1; //>> -右移操作符  移动的是为二进制 10000-->01000
    //右移操作符：
    //1:算术右移
    //右边丢弃，左边补原符号位(正负)
    //2:逻辑右移
    //右边丢弃，左边补0

    printf("b = %d\n", b); //8  0100
    //整数的二进制表示有：原码 反码 补码
    //存储到内存中的是补码，打印的是原码
    int n = -1;
    //1000000000000000000001  原码
    //1111111111111111111110  反码 符号位不变
    //1111111111111111111111  补码

    n >> 1; //向右移动一位 如果是算数右移 补符号位1
    //1111111111111111111111  补码不变所以打印的还是-1


    //对于左移来说 左边丢弃 右边补0
    int y = 5;
    int x = y << 1;  //101->1010
    printf("%d\n", x);



    return 0;
}

int main2()
{
    //& -按照二进制按位与 全为1则为1
//    int a= 3; //011
//    int b = 5; //101
//
//    int c = a&b; //001
//    printf("%d\n",c);


    //|-按位或  只要有一就是一
//    int d= 3; //011
//    int e = 5; //101
//    int f = d|e; //111
//    printf("%d\n",f);

    // ^ 按位异或 （相异则为1）
    int a= 3; //011
    int b = 5; //101

    int c = a^b; //110
    //printf("%d\n",c);


    //**求一个整数中二进制为1 的个数：
    //123
    int num=0;
    int count = 0;
    scanf("%d",&num);
    while(num)
    {
        if(num%2==1)
        {
            count++;
        }
        num = num/2;
    }

    printf("%d",count);
    return 0;
}
int main3()
{
    //32bit
    //当num&1==1 说明最低位肯定是一
    //0000000000000000000000000000011
    //0000000000000000000000000000001
    //0000000000000000000000000000001 按位与1 拿到最低位就是1
    int num = 0;
    scanf("%d",&num);
    int count = 0;
    for(int i = 0; i<32;i++)
    {

        //当前向右移动 i为  就可以分别判断 每一个是什么数字
        if(((num>>i) &1) ==1){
            count ++;
        }
    }
    printf("%d",count);
    return 0;
}
int main4()
{
    short s = 0;
    int a = 10;

    //sizeof()内部是没有发生运算的
    printf("%d\n",sizeof(s = a +5)); //2
    printf("%d",s); //0
}
int main5()
{
    int a = 0;
    printf("%d\n",a); //0
    //00000000000000000000000000000000
    // ~按位取反(二进制)
    //11111111111111111111111111111111 补码
    //11111111111111111111111111111110 反码
    //10000000000000000000000000000001 原码
    printf("%d\n",~a); //打印的其实是原码

    //取反的应用场景
    int x = 11;
    //00000000000000000000000000001011
    //00000000000000000000000000000100    |按位或
    //00000000000000000000000000001111

    //1>>2
    //00000000000000000000000000000001
    //00000000000000000000000000000100
    x =  x |(1<<2);
    printf("%d\n",x); //15

    //还原
    //00000000000000000000000000001111
    //11111111111111111111111111111011  &相异 ~00000000000000000000000000000100
    //00000000000000000000000000001011
    x = x &(~(1<<2));
    printf("%d\n",x); //11

}
//前++  后++
int main6()
{
//    int i= 0,a = 1, b =2 ,c = 3, d =4;
    //0为假 后边不在执行
//    i  = a++ && ++b && d++;   //a=2 b =3 c =3 d =5
    //1为真 后边不在执行  2234
//    i  = a++ || ++b || d++;
//    printf(" a=%d\n b=%d\n c=%d\n d=%d\n",a,b,c,d);// 1 2 3 4

    //逗号表达式
    int a =1;
    int b = 2;
    int c = (a>b,a =a+b,b =a+1); //运算结果为最后一个表达式的结果
    //c是最后一个表达式的结果
    printf(" a=%d\n b=%d\n c=%d\n",a,b,c); //3 4 4

    //真正的判断语句是最后一个d>0，之前的运算也会进行
//    if(a = b+1,c=a/2,d>0)

    //getMax()函数调用操作符

}

//创建一个结构体
struct Stu
{
    char name[20];
    int age;
    char id[20];
};
int main7()
{
    int a = 100;
    //使用struct stu这个类型创建一个学生对象s1
    struct Stu s1 = {"张三",20,"20102030000"};

    struct Stu* ps =&s1;
    //结构体指针->成员名
    printf("%s\n",ps->name);
    printf("%d\n",ps->age);

    return 0;
}
//隐形类型转换
int main8()
{
    //整形转换为
    char a = 3; //0000000000000000000000000000000000000000000000000000000000000011
    char b =127; //000000000000000000000000000000000000000000000000000000001111111
    char c = a+b;//10000010
    //正数的原码 反码 补码相同
    //10000010 补码
    //10000001 -1反码
    //01111110 源码

//整形提升：按照变量数据类型的符号位来进行的
    printf("%d",c); //-126
}


int main()
{
    char a = 0xb6; //10110110
    short b = 0xb600;
    int c = 0xb600000;
    //此时a b发生了整形提升 进行补符号位
    if(a == 0xb6)
    {
        printf("a");
    }
    if(b == 0xb600)
    {
        printf("b");
    }
    if(c == 0xb600000)
    {
        printf("c"); //c
    }

    char ch = 1;
    printf("%u\n",sizeof (ch)); //1
    printf("%u\n",sizeof (+ch)); //4 整形提升为int 所占为4个字节
    printf("%u\n",sizeof (!ch)); //4 逻辑运算
    return 0;
}

